Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH00/edc/PIC32CM5164JH00100.PIC
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHSTATUS" edc:nzwidth="0x8" edc:access="-----rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100604F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PEND" edc:nzwidth="0x1" edc:desc="Channel Pending"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Channel Busy"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Channel Fetch Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1FB0" edc:_addr="0x41006050"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="POSITION" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFFFC" edc:_addr="0x41008000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRAP" edc:nzwidth="0x1" edc:desc="Pointer Value Wraps"/>
            <edc:SFRFieldDef edc:cname="POINTER" edc:nzwidth="0x1D" edc:desc="Trace Packet Location Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="MASTER" edc:nzwidth="0x20" edc:access="n---------------------nnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x800003FF" edc:_addr="0x41008004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5" edc:desc="Maximum Value of the Trace Buffer in SRAM"/>
            <edc:SFRFieldDef edc:cname="TSTARTEN" edc:nzwidth="0x1" edc:desc="Trace Start Input Enable"/>
            <edc:SFRFieldDef edc:cname="TSTOPEN" edc:nzwidth="0x1" edc:desc="Trace Stop Input Enable"/>
            <edc:SFRFieldDef edc:cname="SFRWPRIV" edc:nzwidth="0x1" edc:desc="Special Function Register Write Privilege"/>
            <edc:SFRFieldDef edc:cname="RAMPRIV" edc:nzwidth="0x1" edc:desc="SRAM Privilege"/>
            <edc:SFRFieldDef edc:cname="HALTREQ" edc:nzwidth="0x1" edc:desc="Halt Request"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Main Trace Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="FLOW" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFB" edc:_addr="0x41008008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:nzwidth="0x1" edc:desc="Auto Stop Tracing"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:nzwidth="0x1" edc:desc="Auto Halt Request"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:nzwidth="0x1D" edc:desc="Watermark value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="BASE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4100800C"/>
      <edc:AdjustPoint edc:offset="0xEF0" edc:_addr="0x41008010"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41008F00"/>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0x41008F04"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41008FA0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41008FA4"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41008FA8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="LOCKACCESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41008FB0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FB4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FB8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FBC"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41008FC0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FC8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FCC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FD0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FD4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FD8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FDC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FE0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FE4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FE8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FEC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FF0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FF4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FF8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41008FFC"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="HPB2" edc:beginaddr="0x42000000" edc:endaddr="0x42006C08" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x42000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xB" edc:_addr="0x42000001"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHSTATUS" edc:nzwidth="0x20" edc:access="----rrrrrrrrrrrr----rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF0FFF" edc:_addr="0x4200000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USRRDY0" edc:nzwidth="0x1" edc:desc="Channel 0 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY1" edc:nzwidth="0x1" edc:desc="Channel 1 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY2" edc:nzwidth="0x1" edc:desc="Channel 2 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY3" edc:nzwidth="0x1" edc:desc="Channel 3 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY4" edc:nzwidth="0x1" edc:desc="Channel 4 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY5" edc:nzwidth="0x1" edc:desc="Channel 5 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY6" edc:nzwidth="0x1" edc:desc="Channel 6 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY7" edc:nzwidth="0x1" edc:desc="Channel 7 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY8" edc:nzwidth="0x1" edc:desc="Channel 8 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY9" edc:nzwidth="0x1" edc:desc="Channel 9 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY10" edc:nzwidth="0x1" edc:desc="Channel 10 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY11" edc:nzwidth="0x1" edc:desc="Channel 11 User Ready"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CHBUSY0" edc:nzwidth="0x1" edc:desc="Channel 0 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY1" edc:nzwidth="0x1" edc:desc="Channel 1 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY2" edc:nzwidth="0x1" edc:desc="Channel 2 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY3" edc:nzwidth="0x1" edc:desc="Channel 3 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY4" edc:nzwidth="0x1" edc:desc="Channel 4 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY5" edc:nzwidth="0x1" edc:desc="Channel 5 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY6" edc:nzwidth="0x1" edc:desc="Channel 6 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY7" edc:nzwidth="0x1" edc:desc="Channel 7 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY8" edc:nzwidth="0x1" edc:desc="Channel 8 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY9" edc:nzwidth="0x1" edc:desc="Channel 9 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY10" edc:nzwidth="0x1" edc:desc="Channel 10 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY11" edc:nzwidth="0x1" edc:desc="Channel 11 Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF0FFF" edc:_addr="0x42000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:nzwidth="0x1" edc:desc="Channel 6 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:nzwidth="0x1" edc:desc="Channel 7 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:nzwidth="0x1" edc:desc="Channel 8 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:nzwidth="0x1" edc:desc="Channel 9 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:nzwidth="0x1" edc:desc="Channel 10 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:nzwidth="0x1" edc:desc="Channel 11 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:nzwidth="0x1" edc:desc="Channel 6 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:nzwidth="0x1" edc:desc="Channel 7 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:nzwidth="0x1" edc:desc="Channel 8 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:nzwidth="0x1" edc:desc="Channel 9 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:nzwidth="0x1" edc:desc="Channel 10 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:nzwidth="0x1" edc:desc="Channel 11 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF0FFF" edc:_addr="0x42000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:nzwidth="0x1" edc:desc="Channel 6 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:nzwidth="0x1" edc:desc="Channel 7 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:nzwidth="0x1" edc:desc="Channel 8 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:nzwidth="0x1" edc:desc="Channel 9 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:nzwidth="0x1" edc:desc="Channel 10 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:nzwidth="0x1" edc:desc="Channel 11 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:nzwidth="0x1" edc:desc="Channel 6 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:nzwidth="0x1" edc:desc="Channel 7 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:nzwidth="0x1" edc:desc="Channel 8 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:nzwidth="0x1" edc:desc="Channel 9 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:nzwidth="0x1" edc:desc="Channel 10 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:nzwidth="0x1" edc:desc="Channel 11 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF0FFF" edc:_addr="0x42000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:nzwidth="0x1" edc:desc="Channel 6 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:nzwidth="0x1" edc:desc="Channel 7 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:nzwidth="0x1" edc:desc="Channel 8 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:nzwidth="0x1" edc:desc="Channel 9 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:nzwidth="0x1" edc:desc="Channel 10 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:nzwidth="0x1" edc:desc="Channel 11 Overrun"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:nzwidth="0x1" edc:desc="Channel 6 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:nzwidth="0x1" edc:desc="Channel 7 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:nzwidth="0x1" edc:desc="Channel 8 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:nzwidth="0x1" edc:desc="Channel 9 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:nzwidth="0x1" edc:desc="Channel 10 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:nzwidth="0x1" edc:desc="Channel 11 Event Detection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
